# Comparison
[Comparison with spreadsheets](https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_spreadsheets.html)
Since many potential pandas users have some familiarity with spreadsheet programs like Excel, this page is meant to provide some examples of how various spreadsheet operations would be performed using pandas. This page will use terminology and link to documentation for Excel, but much will be the same/similar in Google Sheets, LibreOffice Calc, Apple Numbers, and other Excel-compatible spreadsheet software.

In [1]:
import pandas as pd
import numpy as np


tips = pd.read_csv('data/tips.csv', delimiter=',')

# Operations on Columns / similar Formulas in Spreadsheets e.g. =A1 + B1
tips['total_bill'] = tips['total_bill'] - 2
tips['new_bill'] = tips['total_bill'] / 2

# Filter Rows / similar Filter in Spreadsheets e.g. Filter
# tips = tips[tips['new_bill'] > 10]
# is_dinner = tips['time'] == 'Dinner'
# tips = tips[is_dinner]
# print(tips['new_bill'].count())

# Conditional Column Creation / similar IF Statements in Spreadsheets e.g. =IF(A1 < 10, "low", "high")
tips['bucket'] = np.where(tips['total_bill'] < 10, 'low', 'high')
filter_bucket = tips['bucket'] == 'high'
# tips = tips[filter_bucket]

# Date Functions / Date and Time Functions in Spreadsheets
tips['date1'] = pd.Timestamp('2013-01-15')
tips['date2'] = pd.Timestamp('2015-02-15')
tips['date1_year'] = tips['date1'].dt.year  # Extract year from date / =YEAR(K2) in Spreadsheets
tips['date2_month'] = tips['date2'].dt.month # Extract month from date / =MONTH(K2) in Spreadsheets
tips['date1_next'] = tips['date1'] + pd.offsets.MonthBegin() # Add one month to date / =DATE(YEAR(K2);MONTH(K2)+1;1) Spreadsheets
tips['months_between'] = tips['date2'].dt.to_period('M') - tips['date1'].dt.to_period('M') # Difference in months between two dates / =DATEDIF(K2;L2;"M") in Spreadsheets

# Selecting Columns / Selecting Cells in Spreadsheets
# tips[['total_bill', 'tip']]  # Select multiple columns
# tips.drop("sex", axis=1, inplace=True)  # Drop a column
# tips.rename(columns={'total_bill': 'total_bill2'}, inplace=True)  # Rename a column

# tips = tips.sort_values(['sex'], ascending=True)  # Sort by a column

# print(tips['time'].str.len())  # String length of column / =LEN(C2) in Spreadsheets
tips['FIND()'] = tips['sex'].str.find('ale') # String search /= FIND('ale';C2) in Spreadsheets
tips['MID()'] = tips['sex'].str[0:1] # String slicing / =MID(C2;1;1) in Spreadsheets
print(tips)

     total_bill   tip     sex smoker   day    time  size  new_bill bucket  \
0         14.99  1.01  Female     No   Sun  Dinner     2     7.495   high
1          8.34  1.66    Male     No   Sun  Dinner     3     4.170    low
2         19.01  3.50    Male     No   Sun  Dinner     3     9.505   high
3         21.68  3.31    Male     No   Sun  Dinner     2    10.840   high
4         22.59  3.61  Female     No   Sun  Dinner     4    11.295   high
..          ...   ...     ...    ...   ...     ...   ...       ...    ...
239       27.03  5.92    Male     No   Sat  Dinner     3    13.515   high
240       25.18  2.00  Female    Yes   Sat  Dinner     2    12.590   high
241       20.67  2.00    Male    Yes   Sat  Dinner     2    10.335   high
242       15.82  1.75    Male     No   Sat  Dinner     2     7.910   high
243       16.78  3.00  Female     No  Thur  Dinner     2     8.390   high

         date1      date2  date1_year  date2_month date1_next  \
0   2013-01-15 2015-02-15        2013            2 2013-02-01
1   2013-01-15 2015-02-15        2013            2 2013-02-01
2   2013-01-15 2015-02-15        2013            2 2013-02-01
3   2013-01-15 2015-02-15        2013            2 2013-02-01
4   2013-01-15 2015-02-15        2013            2 2013-02-01
..         ...        ...         ...          ...        ...
239 2013-01-15 2015-02-15        2013            2 2013-02-01
240 2013-01-15 2015-02-15        2013            2 2013-02-01
241 2013-01-15 2015-02-15        2013            2 2013-02-01
242 2013-01-15 2015-02-15        2013            2 2013-02-01
243 2013-01-15 2015-02-15        2013            2 2013-02-01

       months_between  FIND() MID()
0    <25 * MonthEnds>       3     F
1    <25 * MonthEnds>       1     M
2    <25 * MonthEnds>       1     M
3    <25 * MonthEnds>       1     M
4    <25 * MonthEnds>       3     F
..                ...     ...   ...
239  <25 * MonthEnds>       1     M
240  <25 * MonthEnds>       3     F
241  <25 * MonthEnds>       1     M
242  <25 * MonthEnds>       1     M
243  <25 * MonthEnds>       3     F

[244 rows x 17 columns]

# Extracting nth word
In Excel, you might use the [Text to Columns Wizard](https://support.microsoft.com/en-us/office/split-text-into-different-columns-with-the-convert-text-to-columns-wizard-30b14928-5550-41f5-97ca-7a3e9c363ed7) for splitting text and retrieving a specific column. (Note itâ€™s possible to do so through a formula as well.)

The simplest way to extract words in pandas is to split the strings by spaces, then reference the word by index. Note there are more powerful approaches should you need them.

In [8]:
df = pd.DataFrame({'String': ['John Smith', 'Jane Doe', 'Alice Johnson']})


# Extracting first and last names / similar to using Data > Text to Columns in Spreadsheets
df['first_name'] = df['String'].str.split(" ", expand=True)[0]  # Extract first word
df['last_name'] = df['String'].str.split(" ", expand=True)[1]  # Extract second word


# Convert first name to uppercase and last name to lowercase
df['upper'] = df['first_name'].str.upper() # Convert to uppercase / similar =UPPER(C2) in Spreadsheets
df['lower'] = df['last_name'].str.lower()  # Convert to lowercase / similar =LOWER(C2) in Spreadsheets
df['title'] = df['String'].str.title() # Convert to title case / similar =PROPER(C2) in Spreadsheets

df

          String first_name last_name  upper    lower          title
0     John Smith       John     Smith   JOHN    smith     John Smith
1       Jane Doe       Jane       Doe   JANE      doe       Jane Doe
2  Alice Johnson      Alice   Johnson  ALICE  johnson  Alice Johnson

# Merging
[In Excel, there are merging of tables can be done through a VLOOKUP.](https://support.microsoft.com/en-us/office/how-can-i-merge-two-or-more-tables-c80a9fce-c1ab-4425-bb96-497dd906d656)

In [3]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'Value': np.random.randn(4)})
df2 = pd.DataFrame({'key': [ 'B', 'D', 'D', 'E'], 'Value': np.random.rand(4)})


inner_join = df1.merge(df2, on=['key'], how='inner')
outer_join = df1.merge(df2, on=['key'], how='outer')
left_join = df1.merge(df2, on=['key'], how='left') # Left Join / similar to =VLOOKUP in Excel
right_join = df1.merge(df2, on=['key'], how='right')


left_join

  key   Value_x   Value_y
0   A -0.651565       NaN
1   B -0.677226  0.136728
2   C -0.804261       NaN
3   D  1.312711  0.296462
4   D  1.312711  0.918778

# Fill Handle
Create a series of numbers following a set pattern in a certain set of cells. [In a spreadsheet, this would be done by shift+drag after entering the first number or by entering the first two or three values and then dragging.](https://www.w3schools.com/excel/excel_filling.php)

In [12]:
df = pd.DataFrame({'AAA': [1] * 8, 'BBB': list(range(8))})

df

   AAA  BBB
0    1    0
1    1    1
2    1    2
3    1    3
4    1    4
5    1    5
6    1    6
7    1    7

# Drop Duplicates
Excel has built-in functionality for [removing duplicate values](https://support.microsoft.com/en-us/office/find-and-remove-duplicates-00e35bea-b46a-4d5d-b28e-66a552dc138d). This is supported in pandas via [drop_duplicates()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html#pandas.DataFrame.drop_duplicates).

In [17]:
df = pd.DataFrame(
    {
        "class": ["A", "A", "A", "B", "C", "D"],
        "student_count": [42, 35, 42, 50, 47, 45],
        "all_pass": ["Yes", "Yes", "Yes", "No", "No", "Yes"],
    }
)

# df.drop_duplicates() # Drop duplicate / similar to Data > Remove Duplicates in Spreadsheets
df.drop_duplicates(['class', 'student_count'])  # Drop duplicates based on specific columns

  class  student_count all_pass
0     A             42      Yes
1     A             35      Yes
3     B             50       No
4     C             47       No
5     D             45      Yes

# Pivot Tables
[PivotTables](https://support.microsoft.com/en-us/office/create-a-pivottable-to-analyze-worksheet-data-a9a84538-bfe9-40a9-a8e9-f99134456576) from spreadsheets can be replicated in pandas through [Reshaping and pivot tables](https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_spreadsheets.html#other-considerations). Using the tips dataset again, letâ€™s find the average gratuity by size of the party and sex of the server.

In [28]:
tips = pd.read_csv('data/tips.csv')

# pivot_table = pd.pivot_table(tips, values='tip', index=['size'], columns=['sex'], aggfunc=np.average)  # Create a pivot table with average / similar to PivotTable in Spreadsheets

# or alternatively using pivot_table method
pivot = tips.pivot_table(values='tip', index=['size'], columns=['sex'], aggfunc=np.average)

pivot

sex     Female      Male
size
1     1.276667  1.920000
2     2.528448  2.614184
3     3.250000  3.476667
4     4.021111  4.172143
5     5.140000  3.750000
6     4.600000  5.850000

# Find and Replace
[Excelâ€™s Find dialog](https://support.microsoft.com/en-us/office/find-or-replace-text-and-numbers-on-a-worksheet-0e304ca5-ecef-4808-b90f-fdb42f892e90) takes you to cells that match, one by one. In pandas, this operation is generally done for an entire column or `DataFrame` at once through [conditional expressions](https://pandas.pydata.org/docs/getting_started/intro_tutorials/03_subset_data.html#min-tut-03-subset-rows-and-columns).

In [36]:
tips = pd.read_csv('data/tips.csv')

# tips == 'Sun' # Find all rows where 'day' is 'Sun' / similar to Find in Spreadsheets
# or
# tips['day'].str.contains('Sun')  # Find all rows where 'day' contains 'Sun' / similar to Find in Spreadsheets)

tips.replace('Thur', 'Thursday', inplace=True)  # Replace 'Thu' with 'Thursday' in the 'day' column / similar to Replace All in Spreadsheets

print(tips[tips['day'] == 'Thursday'])  # Display rows where 'day' is 'Thursday'

     total_bill   tip     sex smoker       day    time  size
77        27.20  4.00    Male     No  Thursday   Lunch     4
78        22.76  3.00    Male     No  Thursday   Lunch     2
79        17.29  2.71    Male     No  Thursday   Lunch     2
80        19.44  3.00    Male    Yes  Thursday   Lunch     2
81        16.66  3.40    Male     No  Thursday   Lunch     2
..          ...   ...     ...    ...       ...     ...   ...
202       13.00  2.00  Female    Yes  Thursday   Lunch     2
203       16.40  2.50  Female    Yes  Thursday   Lunch     2
204       20.53  4.00    Male    Yes  Thursday   Lunch     4
205       16.47  3.23  Female    Yes  Thursday   Lunch     3
243       18.78  3.00  Female     No  Thursday  Dinner     2

[62 rows x 7 columns]